USE coursew
GO

DBCC CHECKIDENT ('Person', RESEED, 0)
DBCC CHECKIDENT ('RailwayTicket', RESEED, 0)
DBCC CHECKIDENT ('Train', RESEED, 0)
DBCC CHECKIDENT ('TrainType', RESEED, 0)

DELETE FROM Person
DELETE FROM RailwayTicket
DELETE FROM Train
DELETE FROM TrainType

INSERT INTO dbo.TrainType(Name)
	VALUES
('Пассажирский'),
('Грузовой'),
('Хозяйственный'),
('Воинский'),
('Санитарный'),
('Броневой')

INSERT INTO dbo.Train(TypeId, Model, MaxSpeed, AmountSeat, ManufacturerCountry)
	VALUES
(1, 'UL-11', 157.0, 205, 'Россия'),
(1, 'ML-113', 213.0, 205, 'США'),
(1, 'ZZQ-412', 317.0, 205, 'США'),
(2, 'POA-41', 133.3, 2, 'Китай'),
(2, 'KRAX-221', 133.0, 2, 'Франция'),
(2, 'QQS-11', 141.0, 2, 'Португалия'),
(3, 'EQR-11', 213.0, 5, 'Германия'),
(4, 'ZZX-11', 123.0, 400, 'Россия'),
(5, 'AD-11', 131.0, 2, 'Россия'),
(6, 'ARMOR-14', 300.0, 15, 'Германия')

INSERT INTO dbo.Person(PassportSeries, PassportId, SecondName, FirstName, MiddleName)
	VALUES
(1714, 163622, 'Фетисов', 'Максим', 'Андреевич'),
(1714, 342412, 'Ульянов', 'Артём', 'Владимирович'),
(1714, 425522, 'Хокон', 'Владимир', 'Владимирович'),
(1714, 541155, 'Никонов', 'Всеволод', 'Николаевич'),
(1714, 536377, 'Турлов', 'Илья', 'Евгеньевич'),
(1714, 688544, 'Минаев', 'Георгий', 'Владимирович'),
(1714, 432526, 'Орогнаев', 'Иван', 'Иванович'),
(1714, 747463, 'Дурея', 'Вера', 'Михайловна'),
(1714, 977433, 'Гешефт', 'Алина', 'Ивановна'),
(1714, 637777, 'Шумайс', 'Ира', 'Андреевна')

INSERT INTO dbo.RailwayTicket(TrainId, PersonId, PointOfDeparture, PointOfArrival, DepartureTime, ArrivalTime, CarriageNumber, SeatOfCarriage, TicketPrice)
	VALUES
(1, 1, 'Москва', 'Санкт-Петербург', '2020-15-11 6:00:00', '2020-17-11 16:40:00', 5, 13, 1501.31),
(1, 2, 'Нижний Новгород', 'Москва', '2020-15-11 6:00:00', '2020-17-11 16:40:00', 5, 14, 3134.31),
(1, 3, 'Москва', 'Владивосток', '2020-15-11 6:00:00', '2020-17-11 16:40:00', 5, 16, 3145.31),
(1, 4, 'Москва', 'Сочи', '2020-15-11 6:00:00', '2020-17-11 16:40:00', 5, 17, 2213.31),
(10, 5, 'Москва', 'Анапа', '2020-1-12 15:10:00', '2020-5-12 17:20:00', 1, 1, 5322.31),
(10, 6, 'Нижний Новгород', 'Москва', '2020-21-11 18:40:00', '2020-25-11 3:00:00', 1, 2, 3213.31),
(10, 7, 'Воронеж', 'Казань', '2020-11-11 16:00:00', '2020-18-11 4:00:00', 1, 3, 4123.31),
(9, 8, 'Адлер', 'Екатеренбург', '2020-4-12 1:00:00', '2020-6-12 21:00:00', 2, 1, 1553.31),
(9, 9, 'Киев', 'Минск', '2020-9-11 3:00:00', '2020-12-11 1:00:00', 2, 2, 0.00),
(10, 10, 'Москва', 'Берлин', '2020-25-11 15:00:00', '2020-30-11 15:00:00', 1, 4, 0.00)
